[
      {
        "date": "05/23/2025",
        "weWill": "Wrap up and submit anything still incomplete.",
        "iWill": "Double check that my final project and quiz are both submitted.",
        "eq": "Did I finish my final project to the best of my ability?"
      },
      {
        "date": "05/22/2025",
        "weWill": "Submit final versions of my 3D model and complete the Chapter 7 quiz.",
        "iWill": "Turn in my 3D model PDF and finish the quiz before the deadline.",
        "eq": "Have I shown mastery in CAD modeling and understanding of Chapter 7?"
      },
      {
        "date": "05/21/2025",
        "weWill": "Refine and check model; complete the quiz if I haven't already.",
        "iWill": "Fix model details and verify answers before submitting.",
        "eq": "How do I demonstrate accuracy in both modeling and understanding?"
      },
      {
        "date": "05/20/2025",
        "weWill": "Advance work on the 3D model and take the Chapter 7 quiz.",
        "iWill": "Make progress on my model and complete the quiz if ready.",
        "eq": "What tools and features make CAD more efficient for engineers?"
      },
      {
        "date": "05/19/2025",
        "weWill": "Launch the final project and preview CAD principles from Chapter 7.",
        "iWill": "Start building the object I previously drafted and explore the test.",
        "eq": "How does CAD translate 2D drafting into accurate 3D models?"
      },
      {
        "date": "05/16/2025",
        "weWill": "Show mastery via a quiz and polished dimensioned drawings.",
        "iWill": "Submit Drafting Set #2 and complete the quiz for a grade boost.",
        "eq": "Have I mastered Chapter 10 dimensioning skills for future design work?"
      },
      {
        "date": "05/15/2025",
        "weWill": "Analyze feedback and refine clarity to meet Chapter 10 standards.",
        "iWill": "Revise both drawings to meet rubric mastery.",
        "eq": "How does iterative feedback improve technical accuracy?"
      },
      {
        "date": "05/14/2025",
        "weWill": "Add tolerances and GD&T symbols where required.",
        "iWill": "Finish dimensions and tolerances for drawing #2.",
        "eq": "Why is GD&T critical for part interchangeability?"
      },
      {
        "date": "05/13/2025",
        "weWill": "Apply dimension styles and place size/location dimensions accurately.",
        "iWill": "Complete projection and add all required dimensions for drawing #1.",
        "eq": "What placement strategies ensure readability and minimize errors?"
      },
      {
        "date": "05/12/2025",
        "weWill": "Review dimensioning rules, line conventions, and tolerancing basics.",
        "iWill": "Set up two multiview layouts and begin transferring edges.",
        "eq": "How do dimensions and tolerances communicate manufacturing intent?"
      },
      {
        "date": "05/09/2025",
        "weWill": "Demonstrate mastery via a quiz and submit polished multiview drawings.",
        "iWill": "Finish all three drawings and complete the quiz to boost my grade.",
        "eq": "Have I mastered Chapter 9 multiview skills enough for future drafting tasks?"
      },
      {
        "date": "05/08/2025",
        "weWill": "Analyze feedback and revise drawings to meet mastery criteria.",
        "iWill": "Implement teacher notes to improve accuracy and neatness.",
        "eq": "How does targeted feedback elevate technical drawings?"
      },
      {
        "date": "05/07/2025",
        "weWill": "Continue projecting points and refining line quality.",
        "iWill": "Refine projections and add hidden lines where needed.",
        "eq": "What role does line quality play in communicating design intent?"
      },
      {
        "date": "05/06/2025",
        "weWill": "Apply projection skills to create accurate multiviews with proper line types.",
        "iWill": "Complete at least two of three multiviews independently.",
        "eq": "Which projection techniques ensure true size and shape?"
      },
      {
        "date": "05/05/2025",
        "weWill": "Review orthographic projection rules and model how to convert an isometric to multiview.",
        "iWill": "Identify principal views and set up the layout for three objects.",
        "eq": "How do drafters translate a 3-D object into precise 2-D multiviews?"
      },
    {
        "date": "05/02/2025",
        "weWill": "Demonstrate mastery on the cumulative test and submit polished writing reflections.",
        "iWill": "Apply my knowledge on the test and turn in a single PDF containing my four reflection paragraphs.",
        "eq": "How can I use assessments and reflections to guide future learning in STEM?"
    },
    {
        "date": "05/01/2025",
        "weWill": "Self-assess understanding and clarify any weak areas before Friday’s test.",
        "iWill": "Use study guides, peers, and teacher Q&A to prepare confidently for the assessment.",
        "eq": "What strategies help me solidify and demonstrate engineering knowledge?"
    },
    {
        "date": "04/30/2025",
        "weWill": "Revisit key concepts from Chapters 14-17 through interactive Nearpod challenges.",
        "iWill": "Actively participate in Nearpod activities (quizzes, Time-to-Climb, Draw-It, etc.).",
        "eq": "Which core ideas from Chapters 14-17 are most critical for real-world engineering?"
    },
    {
        "date": "04/29/2025",
        "weWill": "Complete Chapter 17 reading and connect environmental engineering solutions to real-world roles.",
        "iWill": "Draft my Environmental Engineering reflection paragraph and finalize edits to earlier reflections.",
        "eq": "How do environmental engineers balance public health with ecosystem needs?"
    },
    {
        "date": "04/28/2025",
        "weWill": "Connect water-quality basics to the Flint, Michigan crisis.",
        "iWill": "Explain how untreated water corroded Flint’s pipes and list one engineering prevention method.",
        "eq": "Why did Flint’s water become unsafe, and how could engineers have prevented it?"
    },

    {
        "date": "04/28/2025",
        "weWill": "Preview Chapter 17 and explore how poor engineering decisions caused the Flint, MI water crisis.",
        "iWill": "Explain one way environmental engineers protect people from contaminated water.",
        "eq": "Why must engineers consider chemistry (pH, corrosion) before changing a city’s water supply?"
    },
    {
        "date": "04/25/2025",
        "weWill": "Review and finalize our understanding of Chapter 16 bioengineering concepts, address any incomplete reflections, and clarify remaining questions.",
        "iWill": "Finish any outstanding documentary notes or writing, and solidify my grasp on core bioengineering topics (homeostasis, genetics, energy, etc.).",
        "eq": "Which bioengineering insights from this week are most crucial to remember?"
    },
    {
        "date": "04/24/2025",
        "weWill": "Discuss key takeaways from the gene editing documentary and connect insights to Chapter 16 (bioengineering concepts).",
        "iWill": "Summarize the documentary’s main themes and relate them to real-world bioengineering applications.",
        "eq": "How do biotech breakthroughs affect real people, and what are the trade-offs?"
    },
    {
        "date": "04/23/2025",
        "weWill": "Finish the gene editing documentary (Part 2) and explore ethical, social, and technical implications of bioengineering.",
        "iWill": "Complete questions about the documentary, focusing on real-world applications and controversies in gene editing.",
        "eq": "Which ethical challenges arise when we modify the genes of humans, animals, or other organisms?"
    },
    {
        "date": "04/22/2025",
        "weWill": "Continue exploring bioengineering fields and begin watching Part 1 of the gene editing documentary.",
        "iWill": "Take notes during the documentary, focusing on how genetic engineering impacts various fields and industries.",
        "eq": "How does genetic engineering transform different industries, and what are the potential benefits or risks?"
    },
    {
        "date": "04/21/2025",
        "weWill": "Explore foundational bioengineering concepts (cell theory, genetics, homeostasis, and energy) from Chapter 16.",
        "iWill": "Identify the core biological principles that bioengineers use to solve problems in medicine, agriculture, and industry.",
        "eq": "What foundational biology concepts fuel modern bioengineering?"
    },
    {
        "date": "04/17/2025",
        "weWill": "Watch a documentary on UT’s Chemical Engineering department and reflect on the field’s impact, past and present.",
        "iWill": "Take notes on the documentary and answer guiding questions about how chemical engineering transforms society.",
        "eq": "What inspired UT chemical engineers to develop breakthroughs that shape modern life?"
    },
    {
        "date": "04/16/2025",
        "weWill": "Review advanced concepts from Chapter 15, focusing on safety data sheets (SDS), hazard warnings, and environmental impact of chemical processes.",
        "iWill": "Evaluate why safety regulations and environmental considerations are crucial in large-scale chemical plant operations.",
        "eq": "How do safety considerations and environmental regulations influence chemical plant design?"
    },
    {
        "date": "04/15/2025",
        "weWill": "Continue exploring chemical engineering processes (reaction design, measuring flow).",
        "iWill": "Write a short reflection on a chemical operation (mass flow, temperature control) and discuss how it scales up in industry.",
        "eq": "What role do thermodynamics and fluid dynamics play in chemical operations?"
    },
    {
        "date": "04/14/2025",
        "weWill": "Introduce chemical engineering principles (thermodynamics, fluid flow, mass balance).",
        "iWill": "Identify the main goals of chemical engineers and find examples of chemical processes in everyday life.",
        "eq": "How do chemical engineers differ from chemists, and why are large-scale processes crucial?"
    },
    {
        "date": "04/11/2025",
        "weWill": "Review and consolidate aerospace engineering concepts covered this week.",
        "iWill": "Evaluate my understanding of aerospace engineering by writing a short review or Q&A.",
        "eq": "How has my perspective on Aerospace Engineering evolved after this week’s study?"
    },
    {
        "date": "04/10/2025",
        "weWill": "Dive deeper into aerospace engineering case studies and challenges.",
        "iWill": "Summarize key takeaways from the aerospace engineering applications we have studied.",
        "eq": "What are the biggest challenges aerospace engineers face in creating safe, efficient aircraft?"
    },
    {
        "date": "04/09/2025",
        "weWill": "Continue reading the same Chapter 14 material (for students disrupted by STAAR).",
        "iWill": "Write or refine my reflection paragraph, ensuring STAAR-absent students can catch up.",
        "eq": "How can we adapt flight principles to different environments or vehicle types?"
    },
    {
        "date": "04/08/2025",
        "weWill": "Continue reading Chapter 14 with a focus on flight principles and real-world examples.",
        "iWill": "Write a reflection paragraph on a specific aerospace engineering concept.",
        "eq": "Which principles of flight are most crucial to aerospace designs?"
    },
    {
        "date": "04/07/2025",
        "weWill": "Begin exploring basic aerospace engineering concepts and applications (Chapter 14).",
        "iWill": "Identify how aerospace engineers design for flight and space exploration.",
        "eq": "How does Aerospace Engineering shape modern transportation and exploration?"
    },
    {
        "date": "04/04/2025",
        "weWill": "Demonstrate understanding of weekly reading through a quiz and submit accumulated writing.",
        "iWill": "Complete the quiz and submit all written reflections for grading.",
        "eq": "Which engineering fields have piqued my interest the most this week, and why?"
    },
    {
        "date": "04/03/2025",
        "weWill": "Continue reading and reflecting on Civil Engineering concepts and applications.",
        "iWill": "Write a paragraph reflecting on how Civil Engineering aligns with my personal interests.",
        "eq": "How does Civil Engineering impact daily life, and how does it align with my interests?"
    },
    {
        "date": "04/02/2025",
        "weWill": "Begin exploring Civil Engineering and its real-world impact.",
        "iWill": "Write a paragraph reflecting on a Civil Engineering concept or project that interests me.",
        "eq": "What is Civil Engineering, and how does it shape the infrastructure around us?"
    },
    {
        "date": "04/01/2025",
        "weWill": "Continue reading and reflecting on Computer Engineering applications.",
        "iWill": "Write a paragraph reflecting on a Computer Engineering application that interests me.",
        "eq": "What specific aspects of Computer Engineering interest me the most?"
    },
    {
        "date": "03/31/2025",
        "weWill": "Explore the basics of Computer Engineering (Part 1) and its role in modern computing.",
        "iWill": "Identify key aspects of Computer Engineering and how they shape digital systems.",
        "eq": "How does Computer Engineering influence modern technology and daily life?"
    },
    {
        "date": "03/28/2025",
        "weWill": "Demonstrate understanding of weekly reading through a quiz and submit accumulated writing.",
        "iWill": "Complete the quiz and submit all written reflections for grading.",
        "eq": "What have I learned about different types of engineering, and which fields interest me the most?"
    },
    {
        "date": "03/27/2025",
        "weWill": "Read and reflect on Electrical Engineering applications.",
        "iWill": "Write a paragraph reflecting on how Electrical Engineering aligns with personal interests.",
        "eq": "How does Electrical Engineering impact daily life, and how does it align with my interests?"
    },
    {
        "date": "03/26/2025",
        "weWill": "Continue reading and reflecting on Manufacturing Engineering applications.",
        "iWill": "Write a paragraph reflecting on a specific Manufacturing Engineering application that interests me.",
        "eq": "What specific aspects of Manufacturing Engineering interest me the most?"
    },
    {
        "date": "03/25/2025",
        "weWill": "Read and reflect on Manufacturing Engineering applications.",
        "iWill": "Write a paragraph reflecting on how Manufacturing Engineering aligns with personal interests.",
        "eq": "How does Manufacturing Engineering impact daily life, and how does it align with my interests?"
    },
    {
        "date": "03/24/2025",
        "weWill": "Explore the basics of Manufacturing Engineering and its role in modern industry.",
        "iWill": "Identify key aspects of Manufacturing Engineering and its impact on production.",
        "eq": "What is Manufacturing Engineering, and how does it shape our world?"
    },
    {
        "date": "03/21/2025",
        "weWill": "Demonstrate understanding of weekly reading through a quiz and submit accumulated writing.",
        "iWill": "Complete the quiz and submit all written reflections for grading.",
        "eq": "What have I learned about different types of engineering, and which fields interest me the most?"
    },
    {
        "date": "03/20/2025",
        "weWill": "Read and reflect on Materials Engineering applications.",
        "iWill": "Write a paragraph reflecting on how Materials Engineering aligns with personal interests.",
        "eq": "How does Materials Engineering impact daily life, and how does it align with my interests?"
    },
    {
        "date": "03/19/2025",
        "weWill": "Continue reading and reflecting on Mechanical Engineering applications.",
        "iWill": "Write a paragraph reflecting on a specific Mechanical Engineering application that interests me.",
        "eq": "What specific aspects of Mechanical Engineering interest me the most?"
    },
    {
        "date": "03/18/2025",
        "weWill": "Read and reflect on Mechanical Engineering applications.",
        "iWill": "Write a paragraph reflecting on how Mechanical Engineering aligns with personal interests.",
        "eq": "How does Mechanical Engineering impact daily life, and how does it align with my interests?"
    },
    {
        "date": "03/17/2025",
        "weWill": "Analyze personal work preferences and career pathways.",
        "iWill": "Identify personal work style preferences and how they relate to career selection.",
        "eq": "What kind of work environment do I prefer, and how does that impact my career choices?"
    },
    {
        "date": "03/04/2025",
        "weWill": "Complete any final assignments and engage in optional enrichment activities.",
        "iWill": "Ensure all my work is submitted and take part in enrichment if I'm caught up.",
        "eq": "How can I make the most of extra time before the grading period ends?"
    },
    {
        "date": "03/03/2025",
        "weWill": "Use class time to catch up on missing work and prepare for retakes.",
        "iWill": "Check my grades, complete missing assignments, and prepare for test retakes.",
        "eq": "What steps can I take to improve my grade before Spring Break?"
    },
    {
        "date": "02/28/2025",
        "weWill": "Demonstrate understanding of Chapters 1-3 through assessment.",
        "iWill": "Complete my Mastery Test & continue refining my toy rendering.",
        "eq": "How well do I understand drafting concepts from Chapters 1-3?"
    },
    {
        "date": "02/27/2025",
        "weWill": "Apply final touch-ups & corrections before submission.",
        "iWill": "Make final changes and ensure accuracy before submission.",
        "eq": "What final adjustments does my design need?"
    },
    {
        "date": "02/26/2025",
        "weWill": "Assess our work and get feedback on accuracy & design.",
        "iWill": "Review my model and identify what needs improvement.",
        "eq": "How can peer feedback improve my design?"
    },
    {
        "date": "02/25/2025",
        "weWill": "Refine our 3D sketches and apply measurements.",
        "iWill": "Make improvements based on size, proportion, and accuracy.",
        "eq": "Why is accuracy important in 3D modeling?"
    },
    {
        "date": "02/24/2025",
        "weWill": "Start building a 3D model of our toy idea.",
        "iWill": "Create a rough draft of my 3D toy rendering in Tinkercad.",
        "eq": "How do 3D models help bring our ideas to life?"
    },
    {
        "date": "02/21/2025",
        "weWill": "Demonstrate understanding of careers in drafting.",
        "iWill": "Complete my test and submit my Career Reflection.",
        "eq": "How do drafting careers shape modern industries?"
    },
    {
        "date": "02/20/2025",
        "weWill": "Investigate leadership traits & problem-solving in engineering fields.",
        "iWill": "Identify leadership traits I want to develop.",
        "eq": "What does leadership look like in technical careers?"
    },
    {
        "date": "02/19/2025",
        "weWill": "Examine time management & workplace skills in drafting.",
        "iWill": "Evaluate my own time management skills.",
        "eq": "Why is time management important in engineering fields?"
    },
    {
        "date": "02/18/2025",
        "weWill": "Explore career paths in drafting & design.",
        "iWill": "Read Chapter 2 and reflect on drafting careers.",
        "eq": "What career opportunities exist in drafting?"
    },
    {
        "date": "02/14/2025",
        "weWill": "Demonstrate understanding of Chapter 1 & finalize my assignment.",
        "iWill": "Complete my test and assignment submission.",
        "eq": "How does drafting help bring designs to life?"
    },
    {
        "date": "02/13/2025",
        "weWill": "Practice extrusions and constraints in Tinkercad.",
        "iWill": "Use Tinkercad to apply constraints and extrusions.",
        "eq": "How do I use constraints and extrusions in my designs?"
    },
    {
        "date": "02/12/2025",
        "weWill": "Evaluate and reflect on my progress so far in this class.",
        "iWill": "Assess my progress and set goals for improvement.",
        "eq": "How can I improve my efficiency and skills in this class?"
    },
    {
        "date": "02/11/2025",
        "weWill": "Begin learning to create basic sketches in Tinkercad.",
        "iWill": "Use Tinkercad to create a basic sketch.",
        "eq": "How do I create and edit sketches in Tinkercad?"
    },
    {
        "date": "02/10/2025",
        "weWill": "Explore why drafting is important and how it helps us communicate ideas.",
        "iWill": "Read Chapter 1, review slides, and reflect on why drafting matters.",
        "eq": "Why is drafting an essential skill for engineers and designers?"
    },
    {
        "date": "02/07/2025",
        "weWill": "Evaluate progress and refine our toy project ideas.",
        "iWill": "Complete missing work and refine my project based on teacher feedback.",
        "eq": "What adjustments should I make to improve my toy design project?"
    },
    {
        "date": "02/06/2025",
        "weWill": "Understand the importance of punctuality and time management in professional settings.",
        "iWill": "Create a time management plan to improve personal and academic success.",
        "eq": "How can time management and punctuality impact my future success?"
    },
    {
        "date": "02/05/2025",
        "weWill": "Practice writing professional emails and understanding workplace communication.",
        "iWill": "Write a professional email using proper format and tone.",
        "eq": "Why is professional communication important, and how can I improve my email writing?"
    },
    {
        "date": "02/04/2025",
        "weWill": "Explore different STEM careers and understand job qualifications.",
        "iWill": "Identify a STEM career of interest and reflect on job skills needed.",
        "eq": "What skills and education do I need for my ideal STEM career?"
    },
    {
        "date": "02/03/2025",
        "weWill": "Analyze and refine our toy ideas by evaluating strengths, weaknesses, and feasibility.",
        "iWill": "Organize my toy ideas, list pros and cons, and decide on the best concept.",
        "eq": "How can I refine my toy ideas to ensure they are fun, educational, and practical to create?"
    },
    {
        "date": "01/31/2025",
        "weWill": "Begin designing an educational toy and accompanying book that address barriers to STEM engagement for underrepresented groups.",
        "iWill": "Use brainstorming techniques and concept sketches to outline ideas for my toy and book, incorporating mechanical engineering principles.",
        "eq": "How can we design a toy and book that inspire curiosity about mechanical engineering and overcome barriers to STEM for underrepresented groups?"
    },
    {
        "date": "01/30/2025",
        "weWill": "Investigate STEM career paths, emerging technologies, and barriers faced by underrepresented groups in STEM fields.",
        "iWill": "Analyze an existing STEM toy or book for its effectiveness and start researching demographics and emerging technologies to inform my project.",
        "eq": "What challenges do underrepresented groups face in STEM, and how can educational toys and books help address these barriers?"
    },
    {
        "date": "01/29/2025",
        "weWill": "Analyze how toys can balance fun and education by evaluating design features and brainstorming ideas for a new educational toy proposal.",
        "iWill": "Evaluate a toy I remember playing with for its fun and educational features, collaborate with peers to identify key design elements, and reflect on what I need to learn to complete my proposal.",
        "eq": "What design features make a toy both fun and educational, and how can we create a product that inspires curiosity about mechanical engineering?"
    },
    {
        "date": "01/27/2025",
        "weWill": "Deliver presentations and reflect on project outcomes.",
        "iWill": "Evaluate my team’s performance and consider improvements for future projects.",
        "eq": "How can reflecting on a project lead to personal and team growth?"
    },
    {
        "date": "01/24/2025",
        "weWill": "Present project findings, challenges, and solutions.",
        "iWill": "Share my team’s findings and insights during the presentation.",
        "eq": "What strategies make a presentation compelling and effective?"
    },
    {
        "date": "01/23/2025",
        "weWill": "Finalize presentation materials and practice delivery.",
        "iWill": "Ensure my presentation materials are complete and clear.",
        "eq": "How can clear communication enhance understanding of a project?"
    },
    {
        "date": "01/22/2025",
        "weWill": "Test bridge designs to determine maximum weight capacity.",
        "iWill": "Record test data and analyze bridge performance.",
        "eq": "What can we learn from testing and evaluating designs?"
    },
    {
        "date": "01/21/2025",
        "weWill": "Test bridges to ensure they can support a 20 lb. weight for 60 seconds.",
        "iWill": "Participate in the 20 lb. test and document the results in my engineering notebook.",
        "eq": "What strategies ensure structural integrity under load?"
    },
    {
        "date": "01/17/2025",
        "weWill": "Finalize and test bridge structures.",
        "iWill": "Help complete final adjustments and ensure our bridge meets requirements.",
        "eq": "How can data from testing guide improvements in our design?"
    },
    {
        "date": "01/16/2025",
        "weWill": "Test and refine prototypes based on observations and data.",
        "iWill": "Assist in testing and refining our prototype based on results.",
        "eq": "How can we refine our bridge to optimize performance?"
    },
    {
        "date": "01/15/2025",
        "weWill": "Use Fusion 360 to create 3D models of our designs.",
        "iWill": "Complete and review a 3D model of our bridge design using Fusion 360.",
        "eq": "How does CAD software enhance the design process?"
    },
    {
        "date": "01/14/2025",
        "weWill": "Begin planning bridge designs and creating initial prototypes as a team.",
        "iWill": "Collaborate with my team to sketch, model, and plan our bridge design.",
        "eq": "How can we effectively plan a solution to meet design criteria?"
    },
    {
        "date": "01/13/2025",
        "weWill": "Begin planning bridge designs and creating initial prototypes as a team.",
        "iWill": "Collaborate with my team to sketch, model, and plan our bridge design.",
        "eq": "How can we effectively plan a solution to meet design criteria?"
    },
    {
        "date": "01/10/2025",
        "weWill": "Define the problem, brainstorm ideas, and document possible bridge designs as a team.",
        "iWill": "Contribute to my team’s brainstorming process and document our ideas and plans in our engineering notebook.",
        "eq": "How does brainstorming and defining the problem contribute to effective solutions?"
    },
    {
        "date": "01/09/2025",
        "weWill": "Collaborate to form teams, establish group norms, and complete group contracts for successful teamwork.",
        "iWill": "Collaborate with my team to finalize our group contract and agree on roles and responsibilities.",
        "eq": "How can establishing group norms contribute to successful collaboration?"
    },
    {
        "date": "01/08/2025",
        "weWill": "Understand bridge design concepts, the engineering design process, and the challenge criteria.",
        "iWill": "List 'Know' and 'Need-to-Know' information about bridge building and the project requirements in my engineering notebook.",
        "eq": "How can understanding bridge design principles help solve real-world challenges?"
    },
    {
        "date": "12/20/2024",
        "weWill": "Reflect on our semester's work and complete a comprehensive survey about our learning experiences.",
        "iWill": "Evaluate my learning, provide feedback, and plan for next semester.",
        "eq": "How has this semester prepared you for future problem-solving challenges?"
    },
    {
        "date": "12/19/2024",
        "weWill": "Watch and discuss \"Spare Parts\" to learn about teamwork and problem-solving.",
        "iWill": "Consider the lessons from \"Spare Parts\" and apply them to my own problem-solving strategies.",
        "eq": "What does \"Spare Parts\" teach us about innovation and resilience?"
    },
    {
        "date": "12/18/2024",
        "weWill": "Watch and discuss \"Spare Parts\" to learn about teamwork and problem-solving.",
        "iWill": "Analyze the strategies used in \"Spare Parts\" to overcome challenges.",
        "eq": "How can you apply the lessons from \"Spare Parts\" to your own challenges?"
    },
    {
        "date": "12/17/2024",
        "weWill": "Watch and discuss \"Spare Parts\" to learn about teamwork and problem-solving.",
        "iWill": "Reflect on how teamwork and persistence contribute to success in robotics and other fields.",
        "eq": "What makes teamwork effective in achieving difficult goals?"
    },
    {
        "date": "12/16/2024",
        "weWill": "Complete the semester test and continue work on UNIT 9.",
        "iWill": "Take the test and review Python programming concepts. Work on UNIT 9 activities.",
        "eq": "How can you use Python skills and resources to solve problems effectively?"
    }
]
